In [ ]:
# Fazer amostragem estratficada com departamentos e sal√°rios.

<h1 style='font-size:40px'> Employee Turnover Predicting Model</h1>
<div> 
    <ul style='font-size:20px'> 
        <li> 
            This project aims to build a binary classifier that correctly predicts if a given employee is going to stay or quit the company.
        </li>
        <li> 
            The dataset used was encountered in <a href='https://www.coursera.org/projects/employee-turnover-scikit-learn'>Coursera Guided Project</a>. Nonetheless, I've decided to produce my own solution to the case, which is different from the platform instructor's.
        </li>
    </ul>
</div>

<h2 style='font-size:30px'> Loading the Data</h2>

In [44]:
import pandas as pd
import numpy as np

# Since I am looking to create more columns to the DF, I'll modify the maximum number of columns that can be displayed.
pd.set_option('max_columns', None)

# Importing the employee data.
employee_data = pd.read_csv('employee_data.csv')
employee_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,quit,promotion_last_5years,department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [47]:
# Searching for anomalies in the data. All features do not present any null value and have its proper data type assigned.
employee_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   quit                   14999 non-null  int64
 7   promotion_last_5years  14999 non-null  int64
 8   department             14999 non-null  object
 9   salary                 14999 non-null  object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

In [39]:
# Criando o Df
numbers = pd.DataFrame({'A':[1,2,3],
             'B':[10,20,30]})

# Coluna duplicata de 'A'
numbers['C'] = numbers['A']
numbers

   A   B  C
0  1  10  1
1  2  20  2
2  3  30  3

In [40]:
# Verificando a coluna id√™ntica e retirando-a.
for column in numbers.columns[1:]:
    # Neste caso, estamos retirando 'C'.
    if (numbers[column] == numbers['A']).all():
        numbers.drop(column, axis=1, inplace=True)
numbers

   A   B
0  1  10
1  2  20
2  3  30

In [31]:
numbers#.columns.duplicated() #duplicated()

   A   B   C
0  1  10  10
1  2  20  20
2  3  30  30
3  4  40  40

<p style='color:red'> Come√ßar da aula 7</p>